# vstGetCurrPt2D

## Description
```pascal
PROCEDURE vstGetCurrPt2D(
				VAR outX : REAL;
				VAR outY : REAL);
```

```python

def vs.vstGetCurrPt2D():
    return (outX, outY)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|outX|REAL||
|outY|REAL||

## Version
Availability: from Vectorworks 2011
## Category
* Tool Events